Revit 2026 API

# ExportLinetypeKeyOriginalLinetypeName Property

---

The original linetype name.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string OriginalLinetypeName { get; set; }
```
```vb
Public Property OriginalLinetypeName As String
	Get
	Set
```
```cpp
public:
property String^ OriginalLinetypeName {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member OriginalLinetypeName : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

ExportLinetypeKey Class

Autodesk.Revit.DB Namespace